# VerticalAlignment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNoteOptions..::..VerticalAlignment Property
TextNoteOptions Class See Also
---
Vertical alignment of the text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public VerticalTextAlignment VerticalAlignment { get; set; }
```

Visual Basic
---
```text
Public Property VerticalAlignment As VerticalTextAlignment
	Get
	Set
```

Visual C++
---
```text
public:
property VerticalTextAlignment VerticalAlignment {
	VerticalTextAlignment get ();
	void set (VerticalTextAlignment value);
}
```

# Remarks
Default is Top alignment.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
TextNoteOptions Class
Autodesk.Revit.DB Namespace